{
  "events": {
    "technical": [
      {
        "id": 1,
        "name": "Technical Workshop",
        "category": "Technical Workshop",
        "about": "A hands-on session led by experts on emerging technologies like AI, Cloud, and DevOps. You'll get practical exposure and a certificate of participation.",
        "rules": [
          "Individual registration only",
          "Participants must bring their own laptops"
        ],
        "coordinator": {
          "name": "Abhishek Singh",
          "phone": "9749328717"
        }
      },
      {
        "id": 2,
        "name": "Prompt to Product",
        "category": "Technical",
        "about": "An event where teams use AI to build a real-world product from an idea. The event ends with a 3-minute product pitch to judges, with the top 5 teams advancing to a Grand Finale.",
        "rules": [
          "Team Size: Exactly 3 members",
          "Participants must bring their own laptops",
          "Any AI model or tool is permitted",
          "A final report is required, including tools used, GitHub repo, and deployed link"
        ],
        "coordinator": {
          "name": "Sumit Kumar Gupta",
          "phone": "7667827034"
        }
      },
      {
        "id": 3,
        "name": "Competitive Programming",
        "category": "Technical",
        "about": "Welcome to a competitive programming arena where your code is your currency. In this high-stakes survival event, participants must strategically manage their points to acquire new challenges and place wagers on their own solutions. It's a thrilling test of not just coding skill, but also of confidence, risk management, and nerve under pressure.",
        "rulesAndGuidelines": [
          "Participation: Individual only",
          "All participants will begin with an equal, fixed number of starting points",
          "A participant is eliminated if their point total drops to zero or below",
          "Every code submission must be accompanied by a 'Confidence Wager'. A correct submission rewards you with the problem's value plus your wager. An incorrect submission results in the loss of your wagered points",
          "The competition ends when only one participant remains, or when the 2-hour time limit expires. If multiple participants remain, the one with the highest point total wins"
        ],
        "coordinator": {
          "name": "Dhairya Sharma",
          "phone": "9045055914"
        }
      },
      {
        "id": 4,
        "name": "Capture The Flag (CTF)",
        "category": "Technical (Cybersecurity)",
        "about": "A cybersecurity competition where you find hidden \"flags\" in systems. It's a hands-on challenge involving ethical hacking, cryptography, and network security.",
        "rules": [
          "Team Size: 1–3 members",
          "Bring your own laptop with tools pre-installed",
          "The team that captures the most valid flags wins",
          "Sharing flags is not allowed"
        ],
        "coordinator": {
          "name": "Abhijeet Kumar Singh",
          "phone": "9678781811"
        }
      },
      {
        "id": 5,
        "name": "24-Hour Hackathon",
        "category": "Technical",
        "about": "The flagship 24-hour coding marathon to build a working prototype from an idea. Mentors will be available for guidance.",
        "rules": [
          "Team Size: Up to 4 members",
          "This is a 24-hour on-site event",
          "Bring your own laptops and accessories",
          "A final project report with GitHub repo and a demo is required"
        ],
        "coordinators": [
          {
            "name": "Abhishek Murli",
            "phone": "6374795699"
          },
          {
            "name": "Sankalp Shankar",
            "phone": "9153946929"
          }
        ]
      },
      {
        "id": 6,
        "name": "CAED – Computer-Aided Engineering Drawing",
        "category": "Technical",
        "about": "A design challenge focused on precision and creativity using CAD software. Participants will create 2D/3D models based on provided specifications.",
        "rules": [
          "Individual participation only",
          "Bring your own laptop with licensed or educational CAD software (e.g., AutoCAD, SolidWorks)",
          "Evaluation is based on creativity, accuracy, and presentation"
        ],
        "coordinator": {
          "name": "TBD",
          "phone": ""
        }
      },
      {
        "id": 7,
        "name": "Circuit Mania",
        "category": "Technical",
        "about": "A hands-on event for designing, analyzing, and troubleshooting electronic circuits. Challenges will be based on real-world applications.",
        "rules": [
          "Team Size: 1–3 members",
          "Bring your own kits or laptops if needed. Some components will be provided",
          "AI-assisted simulation tools are allowed",
          "Evaluation is based on design efficiency, innovation, and accuracy"
        ],
        "coordinator": {
          "name": "TBD",
          "phone": ""
        }
      },
      {
        "id": 8,
        "name": "Ideathon",
        "category": "Technical / Business",
        "about": "Create a 10-slide investor pitch deck and deliver a compelling 3-minute live pitch. Evaluation will focus on your Go-to-Market strategy, Financials, Innovation, Impact, and Q&A Handling.",
        "rules": [
          "Team Preparation (3–5 Members): Ensure your team has a diverse mix of skills (technical, business, design)",
          "Choose a Product Idea: Select an innovative, commercially viable idea that solves a real problem",
          "Build the 10-Slide Investor Pitch Deck"
        ],
        "pitchDeckSlides": [
          "Slide 1: Title Slide - Project Name, Team Name, Tagline",
          "Slide 2: Problem Statement - Define the problem clearly",
          "Slide 3: Solution Overview - Explain your product/service",
          "Slide 4: Market Opportunity - Define target users and market size",
          "Slide 5: Go-To-Market Strategy - Detail customer acquisition plans",
          "Slide 6: Business Model - Explain your revenue model",
          "Slide 7: Financial Viability - Projections, costs, and funding needs",
          "Slide 8: Innovation & Differentiation - Highlight unique features",
          "Slide 9: Impact Potential - Describe social/economic benefits",
          "Slide 10: Ask + Closing - State funding needs and close strongly"
        ],
        "coordinator": {
          "name": "Farhan",
          "phone": "9037712957"
        }
      }
    ],
    "gaming": [
      {
        "id": 9,
        "name": "PUBG MOBILE (Battle Royale)",
        "category": "Gaming",
        "about": "Enter the battleground and fight for survival in the classic Erangel map! Compete in intense matches where strategy, teamwork, and skill decide who becomes the last squad standing.",
        "rules": [
          "Team Size: Maximum 4 players",
          "Attendance: Minimum 3 players must be present physically; 1 can play online",
          "Format: Battle Royale format only",
          "Equipment: Players must use their own mobile devices"
        ],
        "coordinator": {
          "name": "MD Ashraf N",
          "phone": "+91 80888 92671"
        }
      },
      {
        "id": 10,
        "name": "VALORANT",
        "category": "Gaming",
        "about": "Assemble your squad of agents and dive into tactical 5v5 battles! Compete in thrilling matches that test coordination, reflexes, and strategy.",
        "rules": [
          "Team Size: Maximum 5 players",
          "Attendance: At least 3 players must be present physically; 2 may play online",
          "Equipment: Teams must bring their own equipment (laptop/PC, keyboard, mouse, headset)"
        ],
        "coordinator": {
          "name": "Aswin Kumar",
          "phone": "9431577982"
        }
      },
      {
        "id": 11,
        "name": "FIFA (EA FC 24 or Latest Version)",
        "category": "Gaming",
        "about": "Step onto the virtual pitch and showcase your football finesse! Experience the thrill of one-on-one matches.",
        "rules": [
          "Format: Solo competition (1v1)",
          "Attendance: Physical attendance is compulsory",
          "Controllers: Bring your own or use the limited ones available"
        ],
        "coordinator": {
          "name": "Basil Kuriakose",
          "phone": "9895601118"
        }
      },
      {
        "id": 14,
        "name": "Chess Tournament",
        "category": "Gaming",
        "about": "A battle of wits following FIDE (World Chess Federation) Rules.",
        "tournamentFormat": "Matches will follow FIDE (World Chess Federation) Rules. The format will be Knockout or Swiss, depending on the number of participants",
        "timeControl": "Rapid: 5 minutes + 3 seconds increment. The final time control will be announced before each round",
        "basicRules": [
          "Touch-Move Rule applies",
          "Two illegal moves result in the loss of the game",
          "No external help or devices are allowed",
          "Arriving more than 5 minutes late will result in forfeiture",
          "The arbiter's or organizer's decision is final"
        ],
        "coordinator": {
          "name": "Basavakiran",
          "phone": "9353945902"
        }
      }
    ],
    "nonTechnical": [
      {
        "id": 12,
        "name": "TREASURE HUNT",
        "category": "Non-Technical",
        "about": "Unleash your inner detective and race against time! Follow a trail of hidden clues, solve riddles, and collaborate with your team to uncover the ultimate treasure.",
        "rules": [
          "Team Size: 4 members (from the same institution)",
          "Entry Limit: Only one team per institution is allowed",
          "Restrictions: Use of mobile phones or internet is strictly prohibited unless permitted"
        ],
        "coordinator": {
          "name": "Akshaya",
          "phone": "8904724499"
        }
      },
      {
        "id": 13,
        "name": "Bridge Building",
        "category": "Non-Technical",
        "about": "A design challenge focused on precision and creativity. Participants will construct a model bridge from provided materials based on specifications, which will then be tested for its load-bearing capacity.",
        "rules": [
          "Team Size: 2-4 members",
          "All materials will be provided on-site. Using external materials is prohibited",
          "Evaluation is based on creativity, design efficiency, and the weight the bridge can withstand"
        ],
        "coordinator": {
          "name": "TBD",
          "phone": ""
        }
      }
    ]
  },
  "gamingCoordinator": {
    "name": "Aswin Kumar",
    "phone": "9431577982"
  }
}